betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_rtc.c
/**
  *
  * @file    apm32f4xx_ddl_rtc.c
  * @brief   RTC DDL module driver.
  *
  * @attention
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
  * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
  * IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
  * INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
  * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  * DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
  * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE
  * OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED
  * OF THE POSSIBILITY OF SUCH DAMAGE.
  * The original code has been modified by Geehy Semiconductor.
  * Copyright (c) 2017 STMicroelectronics. Copyright (C) 2023-2025 Geehy Semiconductor.
  * All rights reserved.
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  *
  */
#if defined(USE_FULL_DDL_DRIVER)

/* Includes ------------------------------------------------------------------*/
#include "apm32f4xx_ddl_rtc.h"
#include "apm32f4xx_ddl_cortex.h"

#ifdef  USE_FULL_ASSERT
  #include "apm32_assert.h"
#else
#ifndef ASSERT_PARAM
    #define ASSERT_PARAM(_PARAM_) ((void)(0U))
#endif
#endif

/** @addtogroup APM32F4xx_DDL_Driver
  * @{
  */

#if defined(RTC)

/** @addtogroup RTC_DDL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup RTC_DDL_Private_Constants
  * @{
  */
/* Default values used for prescaler */
#if defined(APM32F403xx) || defined(APM32F402xx)
#define RTC_ASYNCH_PRESC_DEFAULT     0x00007FFFU
#else
#define RTC_ASYNCH_PRESC_DEFAULT     0x0000007FU
#endif /* APM32F403xx || APM32F402xx */
#define RTC_SYNCH_PRESC_DEFAULT      0x000000FFU

/* Values used for timeout */
#define RTC_INITMODE_TIMEOUT         1000U /* 1s when tick set to 1ms */
#define RTC_SYNCHRO_TIMEOUT          1000U /* 1s when tick set to 1ms */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup RTC_DDL_Private_Macros
  * @{
  */

#define IS_DDL_RTC_HOURFORMAT(__VALUE__) (((__VALUE__) == DDL_RTC_HOURFORMAT_24HOUR) \
                                      || ((__VALUE__) == DDL_RTC_HOURFORMAT_AMPM))

#if defined(APM32F403xx) || defined(APM32F402xx)
#define IS_DDL_RTC_ASYNCH_PREDIV(__VALUE__)   ((__VALUE__) <= 0xFFFFFU)
#else
#define IS_DDL_RTC_ASYNCH_PREDIV(__VALUE__)   ((__VALUE__) <= 0x7FU)
#endif /* APM32F403xx || APM32F402xx */

#define IS_DDL_RTC_SYNCH_PREDIV(__VALUE__)    ((__VALUE__) <= 0x7FFFU)

#define IS_DDL_RTC_FORMAT(__VALUE__) (((__VALUE__) == DDL_RTC_FORMAT_BIN) \
                                  || ((__VALUE__) == DDL_RTC_FORMAT_BCD))

#define IS_DDL_RTC_TIME_FORMAT(__VALUE__) (((__VALUE__) == DDL_RTC_TIME_FORMAT_AM_OR_24) \
                                       || ((__VALUE__) == DDL_RTC_TIME_FORMAT_PM))

#define IS_DDL_RTC_HOUR12(__HOUR__)            (((__HOUR__) > 0U) && ((__HOUR__) <= 12U))
#define IS_DDL_RTC_HOUR24(__HOUR__)            ((__HOUR__) <= 23U)
#define IS_DDL_RTC_MINUTES(__MINUTES__)        ((__MINUTES__) <= 59U)
#define IS_DDL_RTC_SECONDS(__SECONDS__)        ((__SECONDS__) <= 59U)

#define IS_DDL_RTC_WEEKDAY(__VALUE__) (((__VALUE__) == DDL_RTC_WEEKDAY_MONDAY) \
                                   || ((__VALUE__) == DDL_RTC_WEEKDAY_TUESDAY) \
                                   || ((__VALUE__) == DDL_RTC_WEEKDAY_WEDNESDAY) \
                                   || ((__VALUE__) == DDL_RTC_WEEKDAY_THURSDAY) \
                                   || ((__VALUE__) == DDL_RTC_WEEKDAY_FRIDAY) \
                                   || ((__VALUE__) == DDL_RTC_WEEKDAY_SATURDAY) \
                                   || ((__VALUE__) == DDL_RTC_WEEKDAY_SUNDAY))

#define IS_DDL_RTC_DAY(__DAY__)     (((__DAY__) >= 1U) && ((__DAY__) <= 31U))

#define IS_DDL_RTC_MONTH(__MONTH__) (((__MONTH__) >= 1U) && ((__MONTH__) <= 12U))

#define IS_DDL_RTC_YEAR(__YEAR__)   ((__YEAR__) <= 99U)

#define IS_DDL_RTC_ALMA_MASK(__VALUE__) (((__VALUE__) == DDL_RTC_ALMA_MASK_NONE) \
                                     || ((__VALUE__) == DDL_RTC_ALMA_MASK_DATEWEEKDAY) \
                                     || ((__VALUE__) == DDL_RTC_ALMA_MASK_HOURS) \
                                     || ((__VALUE__) == DDL_RTC_ALMA_MASK_MINUTES) \
                                     || ((__VALUE__) == DDL_RTC_ALMA_MASK_SECONDS) \
                                     || ((__VALUE__) == DDL_RTC_ALMA_MASK_ALL))

#define IS_DDL_RTC_ALMB_MASK(__VALUE__) (((__VALUE__) == DDL_RTC_ALMB_MASK_NONE) \
                                     || ((__VALUE__) == DDL_RTC_ALMB_MASK_DATEWEEKDAY) \
                                     || ((__VALUE__) == DDL_RTC_ALMB_MASK_HOURS) \
                                     || ((__VALUE__) == DDL_RTC_ALMB_MASK_MINUTES) \
                                     || ((__VALUE__) == DDL_RTC_ALMB_MASK_SECONDS) \
                                     || ((__VALUE__) == DDL_RTC_ALMB_MASK_ALL))

#define IS_DDL_RTC_ALMA_DATE_WEEKDAY_SEL(__SEL__) (((__SEL__) == DDL_RTC_ALMA_DATEWEEKDAYSEL_DATE) || \
                                                  ((__SEL__) == DDL_RTC_ALMA_DATEWEEKDAYSEL_WEEKDAY))

