betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_rtc.c
#define IS_DDL_RTC_ALMB_DATE_WEEKDAY_SEL(__SEL__) (((__SEL__) == DDL_RTC_ALMB_DATEWEEKDAYSEL_DATE) || \
                                                  ((__SEL__) == DDL_RTC_ALMB_DATEWEEKDAYSEL_WEEKDAY))

#define IS_DDL_RTC_CALIB_OUTPUT(__OUTPUT__) (((__OUTPUT__) == DDL_RTC_CALIB_OUTPUT_NONE) || \
                                             ((__OUTPUT__) == DDL_RTC_CALIB_OUTPUT_RTCCLOCK) || \
                                             ((__OUTPUT__) == DDL_RTC_CALIB_OUTPUT_ALARM) || \
                                             ((__OUTPUT__) == DDL_RTC_CALIB_OUTPUT_SECOND))
/**
  * @}
  */
/* Private function prototypes -----------------------------------------------*/
/* Exported functions --------------------------------------------------------*/
/** @addtogroup RTC_DDL_Exported_Functions
  * @{
  */

/** @addtogroup RTC_DDL_EF_Init
  * @{
  */

/**
  * @brief  De-Initializes the RTC registers to their default reset values.
  * @note   This function does not reset the RTC Clock source and RTC Backup Data
  *         registers.
  * @param  RTCx RTC Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC registers are de-initialized
  *          - ERROR: RTC registers are not de-initialized
  */
ErrorStatus DDL_RTC_DeInit(RTC_TypeDef *RTCx)
{
  ErrorStatus status = ERROR;

  /* Check the parameter */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));

  /* Disable the write protection for RTC registers */
  DDL_RTC_DisableWriteProtection(RTCx);

  /* Set Initialization mode */
  if (DDL_RTC_EnterInitMode(RTCx) != ERROR)
  {
#if defined (BAKPR)
    DDL_RTC_WriteReg(RTCx, CNTL,    0x0000);
    DDL_RTC_WriteReg(RTCx, CNTH,    0x0000);
    DDL_RTC_WriteReg(RTCx, PSCRLDH, 0x0000);
    DDL_RTC_WriteReg(RTCx, PSCRLDL, 0x8000);
    DDL_RTC_WriteReg(RTCx, CTRL,    0x0000);
    DDL_RTC_WriteReg(RTCx, CSTS,    0x0020);

    /* Reset Tamper and alternate functions configuration register */
    DDL_RTC_WriteReg(BAKPR, CLKCAL, 0x00000000U);
    DDL_RTC_WriteReg(BAKPR, CTRL,   0x00000000U);
    DDL_RTC_WriteReg(BAKPR, CSTS,   0x00000000U);

    /* Exit Initialization Mode */
    if (DDL_RTC_ExitInitMode(RTCx) != ERROR)
    {
      /* Wait till the RTC RSF flag is set */
      status = DDL_RTC_WaitForSynchro(RTCx);

      /* Clear RSF Flag */
      DDL_RTC_ClearFlag_RS(RTCx);

      /* Enable the write protection for RTC registers */
      DDL_RTC_EnableWriteProtection(RTCx);
    }
#else
    /* Reset TIME, DATE and CTRL registers */
    DDL_RTC_WriteReg(RTCx, TIME,       0x00000000U);
    DDL_RTC_WriteReg(RTCx, AUTORLD,     RTC_AUTORLD_WUAUTORE);
    DDL_RTC_WriteReg(RTCx, DATE,      (RTC_DATE_WEEKSEL_0 | RTC_DATE_MONU_0 | RTC_DATE_DAYU_0));

    /* Reset All CTRL bits except CTRL[2:0] */
    DDL_RTC_WriteReg(RTCx, CTRL, (DDL_RTC_ReadReg(RTCx, CTRL) & RTC_CTRL_WUCLKSEL));

    DDL_RTC_WriteReg(RTCx, PSC,    (RTC_PSC_APSC | RTC_SYNCH_PRESC_DEFAULT));
    DDL_RTC_WriteReg(RTCx, ALRMA,   0x00000000U);
    DDL_RTC_WriteReg(RTCx, ALRMB,   0x00000000U);
    DDL_RTC_WriteReg(RTCx, CAL,     0x00000000U);
    DDL_RTC_WriteReg(RTCx, SHIFT,   0x00000000U);
    DDL_RTC_WriteReg(RTCx, ALRMASS, 0x00000000U);
    DDL_RTC_WriteReg(RTCx, ALRMBSS, 0x00000000U);

    /* Reset STS register and exit initialization mode */
    DDL_RTC_WriteReg(RTCx, STS,      0x00000000U);

    /* Reset Tamper and alternate functions configuration register */
    DDL_RTC_WriteReg(RTCx, TACFG, 0x00000000U);

    /* Wait till the RTC RSF flag is set */
    status = DDL_RTC_WaitForSynchro(RTCx);
#endif /* BAKPR */
  }

  /* Enable the write protection for RTC registers */
  DDL_RTC_EnableWriteProtection(RTCx);

  return status;
}

/**
  * @brief  Initializes the RTC registers according to the specified parameters
  *         in RTC_InitStruct.
  * @param  RTCx RTC Instance
  * @param  RTC_InitStruct pointer to a @ref DDL_RTC_InitTypeDef structure that contains
  *         the configuration information for the RTC peripheral.
  * @note   The RTC Prescaler register is write protected and can be written in
  *         initialization mode only.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC registers are initialized
  *          - ERROR: RTC registers are not initialized
  */
ErrorStatus DDL_RTC_Init(RTC_TypeDef *RTCx, DDL_RTC_InitTypeDef *RTC_InitStruct)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));
#if defined (RTC_CTRL_TIMEFCFG)
  ASSERT_PARAM(IS_DDL_RTC_HOURFORMAT(RTC_InitStruct->HourFormat));
#endif /* RTC_CTRL_TIMEFCFG */
  ASSERT_PARAM(IS_DDL_RTC_ASYNCH_PREDIV(RTC_InitStruct->AsynchPrescaler));
#if defined (RTC_PSC_SPSC)
  ASSERT_PARAM(IS_DDL_RTC_SYNCH_PREDIV(RTC_InitStruct->SynchPrescaler));
#endif /* RTC_PSC_SPSC */
#if defined (BAKPR)
  ASSERT_PARAM(IS_DDL_RTC_CALIB_OUTPUT(RTC_InitStruct->OutPutSource));
#endif /* BAKPR */

#if defined (RTC_WRPROT_KEY)
  /* Disable the write protection for RTC registers */
  DDL_RTC_DisableWriteProtection(RTCx);

  /* Set Initialization mode */
  if (DDL_RTC_EnterInitMode(RTCx) != ERROR)
  {
    /* Set Hour Format */
    DDL_RTC_SetHourFormat(RTCx, RTC_InitStruct->HourFormat);

    /* Configure Synchronous and Asynchronous prescaler factor */
    DDL_RTC_SetSynchPrescaler(RTCx, RTC_InitStruct->SynchPrescaler);
    DDL_RTC_SetAsynchPrescaler(RTCx, RTC_InitStruct->AsynchPrescaler);

    /* Exit Initialization mode */
    DDL_RTC_DisableInitMode(RTCx);

    status = SUCCESS;
  }
  /* Enable the write protection for RTC registers */
  DDL_RTC_EnableWriteProtection(RTCx);
#else
  /* Waiting for synchro */
  if (DDL_RTC_WaitForSynchro(RTCx) != ERROR)
  {
    /* Set Initialization mode */
    if (DDL_RTC_EnterInitMode(RTCx) != ERROR)
    {
      /* Clear Flag Bits */
      DDL_RTC_ClearFlag_ALR(RTCx);
      DDL_RTC_ClearFlag_OW(RTCx);
      DDL_RTC_ClearFlag_SEC(RTCx);

      if (RTC_InitStruct->OutPutSource != DDL_RTC_CALIB_OUTPUT_NONE)
      {
        /* Disable the selected Tamper Pin */
        DDL_RTC_TAMPER_Disable(BAKPR);
      }
      /* Set the signal which will be routed to RTC Tamper Pin */
      DDL_RTC_SetOutputSource(BAKPR, RTC_InitStruct->OutPutSource);

      /* Configure Synchronous and Asynchronous prescaler factor */
      DDL_RTC_SetAsynchPrescaler(RTCx, RTC_InitStruct->AsynchPrescaler);

      /* Exit Initialization Mode */
      DDL_RTC_ExitInitMode(RTCx);

      status = SUCCESS;
    }
  }
#endif /* RTC_WRPROT_KEY */

