betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_rtc.c
  return status;
}

/**
  * @brief  Set each @ref DDL_RTC_InitTypeDef field to default value.
  * @param  RTC_InitStruct pointer to a @ref DDL_RTC_InitTypeDef structure which will be initialized.
  * @retval None
  */
void DDL_RTC_StructInit(DDL_RTC_InitTypeDef *RTC_InitStruct)
{
  /* Set RTC_InitStruct fields to default values */
#if defined (RTC_CTRL_TIMEFCFG)
  RTC_InitStruct->HourFormat      = DDL_RTC_HOURFORMAT_24HOUR;
#endif /* RTC_CTRL_TIMEFCFG */
  RTC_InitStruct->AsynchPrescaler = RTC_ASYNCH_PRESC_DEFAULT;
#if defined (RTC_PSC_SPSC)
  RTC_InitStruct->SynchPrescaler  = RTC_SYNCH_PRESC_DEFAULT;
#endif /* RTC_PSC_SPSC */
#if defined (BAKPR)
  RTC_InitStruct->OutPutSource    = DDL_RTC_CALIB_OUTPUT_NONE;
#endif /* BAKPR */
}

/**
  * @brief  Set the RTC current time.
  * @param  RTCx RTC Instance
  * @param  RTC_Format This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_FORMAT_BIN
  *         @arg @ref DDL_RTC_FORMAT_BCD
  * @param  RTC_TimeStruct pointer to a RTC_TimeTypeDef structure that contains
  *                        the time configuration information for the RTC.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC Time register is configured
  *          - ERROR: RTC Time register is not configured
  */
ErrorStatus DDL_RTC_TIME_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_TimeTypeDef *RTC_TimeStruct)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));
  ASSERT_PARAM(IS_DDL_RTC_FORMAT(RTC_Format));

  if (RTC_Format == DDL_RTC_FORMAT_BIN)
  {
#if defined (RTC_CTRL_TIMEFCFG)
    if (DDL_RTC_GetHourFormat(RTCx) != DDL_RTC_HOURFORMAT_24HOUR)
    {
      ASSERT_PARAM(IS_DDL_RTC_HOUR12(RTC_TimeStruct->Hours));
      ASSERT_PARAM(IS_DDL_RTC_TIME_FORMAT(RTC_TimeStruct->TimeFormat));
    }
    else
    {
      RTC_TimeStruct->TimeFormat = 0x00U;
      ASSERT_PARAM(IS_DDL_RTC_HOUR24(RTC_TimeStruct->Hours));
    }
#else
    ASSERT_PARAM(IS_DDL_RTC_HOUR24(RTC_TimeStruct->Hours));
#endif /* RTC_CTRL_TIMEFCFG */
    ASSERT_PARAM(IS_DDL_RTC_MINUTES(RTC_TimeStruct->Minutes));
    ASSERT_PARAM(IS_DDL_RTC_SECONDS(RTC_TimeStruct->Seconds));
  }
  else
  {
#if defined (RTC_CTRL_TIMEFCFG)
    if (DDL_RTC_GetHourFormat(RTCx) != DDL_RTC_HOURFORMAT_24HOUR)
    {
      ASSERT_PARAM(IS_DDL_RTC_HOUR12(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Hours)));
      ASSERT_PARAM(IS_DDL_RTC_TIME_FORMAT(RTC_TimeStruct->TimeFormat));
    }
    else
    {
      RTC_TimeStruct->TimeFormat = 0x00U;
      ASSERT_PARAM(IS_DDL_RTC_HOUR24(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Hours)));
    }
#else
    ASSERT_PARAM(IS_DDL_RTC_HOUR24(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Hours)));
#endif /* RTC_CTRL_TIMEFCFG */
    ASSERT_PARAM(IS_DDL_RTC_MINUTES(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Minutes)));
    ASSERT_PARAM(IS_DDL_RTC_SECONDS(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Seconds)));
  }

#if defined (RTC_WRPROT_KEY)
  /* Disable the write protection for RTC registers */
  DDL_RTC_DisableWriteProtection(RTCx);
#endif /* RTC_WRPROT_KEY */

  /* Set Initialization mode */
  if (DDL_RTC_EnterInitMode(RTCx) != ERROR)
  {
    /* Check the input parameters format */
    if (RTC_Format != DDL_RTC_FORMAT_BIN)
    {
#if defined (RTC_COUNT_SUPPORT)
      DDL_RTC_TIME_Set(RTCx, (((uint32_t)(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Hours)) * 3600U) + \
                              ((uint32_t)(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Minutes)) * 60U) + \
                              ((uint32_t)(__DDL_RTC_CONVERT_BCD2BIN(RTC_TimeStruct->Seconds)))));
#else
      DDL_RTC_TIME_Config(RTCx, RTC_TimeStruct->TimeFormat, RTC_TimeStruct->Hours,
                         RTC_TimeStruct->Minutes, RTC_TimeStruct->Seconds);
#endif /* RTC_COUNT_SUPPORT */
    }
    else
    {
#if defined (RTC_COUNT_SUPPORT)
      DDL_RTC_TIME_Set(RTCx, (uint32_t)(((uint32_t)RTC_TimeStruct->Hours * 3600U) + \
                                        ((uint32_t)RTC_TimeStruct->Minutes * 60U) + \
                                        ((uint32_t)RTC_TimeStruct->Seconds)));
#else
      DDL_RTC_TIME_Config(RTCx, RTC_TimeStruct->TimeFormat, __DDL_RTC_CONVERT_BIN2BCD(RTC_TimeStruct->Hours),
                         __DDL_RTC_CONVERT_BIN2BCD(RTC_TimeStruct->Minutes),
                         __DDL_RTC_CONVERT_BIN2BCD(RTC_TimeStruct->Seconds));
#endif /* RTC_COUNT_SUPPORT */
    }
#if defined (RTC_STS_INITEN)
    /* Exit Initialization mode */
    DDL_RTC_DisableInitMode(RTCx);

    /* If  RTC_CTRL_RCMCFG bit = 0, wait for synchro else this check is not needed */
    if (DDL_RTC_IsShadowRegBypassEnabled(RTCx) == 0U)
    {
      status = DDL_RTC_WaitForSynchro(RTCx);
    }
    else
#endif /* RTC_STS_INITEN */
    {
      status = SUCCESS;
    }
  }
#if defined (RTC_WRPROT_KEY)
  /* Enable the write protection for RTC registers */
  DDL_RTC_EnableWriteProtection(RTCx);
#else
  /* Exit Initialization mode */
  DDL_RTC_ExitInitMode(RTCx);
#endif /* RTC_WRPROT_KEY */

  return status;
}

/**
  * @brief  Set each @ref DDL_RTC_TimeTypeDef field to default value (Time = 00h:00min:00sec).
  * @param  RTC_TimeStruct pointer to a @ref DDL_RTC_TimeTypeDef structure which will be initialized.
  * @retval None
  */
void DDL_RTC_TIME_StructInit(DDL_RTC_TimeTypeDef *RTC_TimeStruct)
{
  /* Time = 00h:00min:00sec */
#if defined (RTC_TIME_TIMEFCFG)
  RTC_TimeStruct->TimeFormat = DDL_RTC_TIME_FORMAT_AM_OR_24;
#endif /* RTC_TIME_TIMEFCFG */
  RTC_TimeStruct->Hours      = 0U;
  RTC_TimeStruct->Minutes    = 0U;
  RTC_TimeStruct->Seconds    = 0U;
}

#if defined (RTC_CALENDAR_SUPPORT)
/**
  * @brief  Set the RTC current date.
  * @param  RTCx RTC Instance
  * @param  RTC_Format This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_FORMAT_BIN
  *         @arg @ref DDL_RTC_FORMAT_BCD
  * @param  RTC_DateStruct pointer to a RTC_DateTypeDef structure that contains
  *                         the date configuration information for the RTC.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC Day register is configured
  *          - ERROR: RTC Day register is not configured
  */
ErrorStatus DDL_RTC_DATE_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_DateTypeDef *RTC_DateStruct)
{
  ErrorStatus status = ERROR;

  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));
  ASSERT_PARAM(IS_DDL_RTC_FORMAT(RTC_Format));

  if ((RTC_Format == DDL_RTC_FORMAT_BIN) && ((RTC_DateStruct->Month & 0x10U) == 0x10U))
  {
    RTC_DateStruct->Month = (uint8_t)(RTC_DateStruct->Month & (uint8_t)~(0x10U)) + 0x0AU;
  }
  if (RTC_Format == DDL_RTC_FORMAT_BIN)
  {
    ASSERT_PARAM(IS_DDL_RTC_YEAR(RTC_DateStruct->Year));
    ASSERT_PARAM(IS_DDL_RTC_MONTH(RTC_DateStruct->Month));
    ASSERT_PARAM(IS_DDL_RTC_DAY(RTC_DateStruct->Day));
  }
  else
  {
    ASSERT_PARAM(IS_DDL_RTC_YEAR(__DDL_RTC_CONVERT_BCD2BIN(RTC_DateStruct->Year)));
    ASSERT_PARAM(IS_DDL_RTC_MONTH(__DDL_RTC_CONVERT_BCD2BIN(RTC_DateStruct->Month)));
    ASSERT_PARAM(IS_DDL_RTC_DAY(__DDL_RTC_CONVERT_BCD2BIN(RTC_DateStruct->Day)));
  }
  ASSERT_PARAM(IS_DDL_RTC_WEEKDAY(RTC_DateStruct->WeekDay));

  /* Disable the write protection for RTC registers */
  DDL_RTC_DisableWriteProtection(RTCx);

  /* Set Initialization mode */
  if (DDL_RTC_EnterInitMode(RTCx) != ERROR)
  {
    /* Check the input parameters format */
    if (RTC_Format != DDL_RTC_FORMAT_BIN)
    {
      DDL_RTC_DATE_Config(RTCx, RTC_DateStruct->WeekDay, RTC_DateStruct->Day, RTC_DateStruct->Month, RTC_DateStruct->Year);
    }
    else
    {
      DDL_RTC_DATE_Config(RTCx, RTC_DateStruct->WeekDay, __DDL_RTC_CONVERT_BIN2BCD(RTC_DateStruct->Day),
                         __DDL_RTC_CONVERT_BIN2BCD(RTC_DateStruct->Month), __DDL_RTC_CONVERT_BIN2BCD(RTC_DateStruct->Year));
    }

    /* Exit Initialization mode */
    DDL_RTC_DisableInitMode(RTCx);

    /* If  RTC_CTRL_RCMCFG bit = 0, wait for synchro else this check is not needed */
    if (DDL_RTC_IsShadowRegBypassEnabled(RTCx) == 0U)
    {
      status = DDL_RTC_WaitForSynchro(RTCx);
    }
    else
    {
      status = SUCCESS;
    }
  }
  /* Enable the write protection for RTC registers */
  DDL_RTC_EnableWriteProtection(RTCx);

