betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_rtc.c
  return status;
}

/**
  * @brief  Set each @ref DDL_RTC_DateTypeDef field to default value (date = Monday, January 01 xx00)
  * @param  RTC_DateStruct pointer to a @ref DDL_RTC_DateTypeDef structure which will be initialized.
  * @retval None
  */
void DDL_RTC_DATE_StructInit(DDL_RTC_DateTypeDef *RTC_DateStruct)
{
  /* Monday, January 01 xx00 */
  RTC_DateStruct->WeekDay = DDL_RTC_WEEKDAY_MONDAY;
  RTC_DateStruct->Day     = 1U;
  RTC_DateStruct->Month   = DDL_RTC_MONTH_JANUARY;
  RTC_DateStruct->Year    = 0U;
}
#endif /* RTC_CALENDAR_SUPPORT */

#if defined (RTC_ALARMA_SUPPORT)
/**
  * @brief  Set the RTC Alarm A.
  * @note   The Alarm register can only be written when the corresponding Alarm
  *         is disabled (Use @ref DDL_RTC_ALMA_Disable function).
  * @param  RTCx RTC Instance
  * @param  RTC_Format This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_FORMAT_BIN
  *         @arg @ref DDL_RTC_FORMAT_BCD
  * @param  RTC_AlarmStruct pointer to a @ref DDL_RTC_AlarmTypeDef structure that
  *                         contains the alarm configuration parameters.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ALARMA registers are configured
  *          - ERROR: ALARMA registers are not configured
  */
ErrorStatus DDL_RTC_ALMA_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_AlarmTypeDef *RTC_AlarmStruct)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));
  ASSERT_PARAM(IS_DDL_RTC_FORMAT(RTC_Format));
  ASSERT_PARAM(IS_DDL_RTC_ALMA_MASK(RTC_AlarmStruct->AlarmMask));
  ASSERT_PARAM(IS_DDL_RTC_ALMA_DATE_WEEKDAY_SEL(RTC_AlarmStruct->AlarmDateWeekDaySel));

  if (RTC_Format == DDL_RTC_FORMAT_BIN)
  {
    if (DDL_RTC_GetHourFormat(RTCx) != DDL_RTC_HOURFORMAT_24HOUR)
    {
      ASSERT_PARAM(IS_DDL_RTC_HOUR12(RTC_AlarmStruct->AlarmTime.Hours));
      ASSERT_PARAM(IS_DDL_RTC_TIME_FORMAT(RTC_AlarmStruct->AlarmTime.TimeFormat));
    }
    else
    {
      RTC_AlarmStruct->AlarmTime.TimeFormat = 0x00U;
      ASSERT_PARAM(IS_DDL_RTC_HOUR24(RTC_AlarmStruct->AlarmTime.Hours));
    }
    ASSERT_PARAM(IS_DDL_RTC_MINUTES(RTC_AlarmStruct->AlarmTime.Minutes));
    ASSERT_PARAM(IS_DDL_RTC_SECONDS(RTC_AlarmStruct->AlarmTime.Seconds));

    if (RTC_AlarmStruct->AlarmDateWeekDaySel == DDL_RTC_ALMA_DATEWEEKDAYSEL_DATE)
    {
      ASSERT_PARAM(IS_DDL_RTC_DAY(RTC_AlarmStruct->AlarmDateWeekDay));
    }
    else
    {
      ASSERT_PARAM(IS_DDL_RTC_WEEKDAY(RTC_AlarmStruct->AlarmDateWeekDay));
    }
  }
  else
  {
    if (DDL_RTC_GetHourFormat(RTCx) != DDL_RTC_HOURFORMAT_24HOUR)
    {
      ASSERT_PARAM(IS_DDL_RTC_HOUR12(__DDL_RTC_CONVERT_BCD2BIN(RTC_AlarmStruct->AlarmTime.Hours)));
      ASSERT_PARAM(IS_DDL_RTC_TIME_FORMAT(RTC_AlarmStruct->AlarmTime.TimeFormat));
    }
    else
    {
      RTC_AlarmStruct->AlarmTime.TimeFormat = 0x00U;
      ASSERT_PARAM(IS_DDL_RTC_HOUR24(__DDL_RTC_CONVERT_BCD2BIN(RTC_AlarmStruct->AlarmTime.Hours)));
    }

    ASSERT_PARAM(IS_DDL_RTC_MINUTES(__DDL_RTC_CONVERT_BCD2BIN(RTC_AlarmStruct->AlarmTime.Minutes)));
    ASSERT_PARAM(IS_DDL_RTC_SECONDS(__DDL_RTC_CONVERT_BCD2BIN(RTC_AlarmStruct->AlarmTime.Seconds)));

    if (RTC_AlarmStruct->AlarmDateWeekDaySel == DDL_RTC_ALMA_DATEWEEKDAYSEL_DATE)
    {
      ASSERT_PARAM(IS_DDL_RTC_DAY(__DDL_RTC_CONVERT_BCD2BIN(RTC_AlarmStruct->AlarmDateWeekDay)));
    }
    else
    {
      ASSERT_PARAM(IS_DDL_RTC_WEEKDAY(__DDL_RTC_CONVERT_BCD2BIN(RTC_AlarmStruct->AlarmDateWeekDay)));
    }
  }

  /* Disable the write protection for RTC registers */
  DDL_RTC_DisableWriteProtection(RTCx);

  /* Select weekday selection */
  if (RTC_AlarmStruct->AlarmDateWeekDaySel == DDL_RTC_ALMA_DATEWEEKDAYSEL_DATE)
  {
    /* Set the date for ALARM */
    DDL_RTC_ALMA_DisableWeekday(RTCx);
    if (RTC_Format != DDL_RTC_FORMAT_BIN)
    {
      DDL_RTC_ALMA_SetDay(RTCx, RTC_AlarmStruct->AlarmDateWeekDay);
    }
    else
    {
      DDL_RTC_ALMA_SetDay(RTCx, __DDL_RTC_CONVERT_BIN2BCD(RTC_AlarmStruct->AlarmDateWeekDay));
    }
  }
  else
  {
    /* Set the week day for ALARM */
    DDL_RTC_ALMA_EnableWeekday(RTCx);
    DDL_RTC_ALMA_SetWeekDay(RTCx, RTC_AlarmStruct->AlarmDateWeekDay);
  }

  /* Configure the Alarm register */
  if (RTC_Format != DDL_RTC_FORMAT_BIN)
  {
    DDL_RTC_ALMA_ConfigTime(RTCx, RTC_AlarmStruct->AlarmTime.TimeFormat, RTC_AlarmStruct->AlarmTime.Hours,
                           RTC_AlarmStruct->AlarmTime.Minutes, RTC_AlarmStruct->AlarmTime.Seconds);
  }
  else
  {
    DDL_RTC_ALMA_ConfigTime(RTCx, RTC_AlarmStruct->AlarmTime.TimeFormat,
                           __DDL_RTC_CONVERT_BIN2BCD(RTC_AlarmStruct->AlarmTime.Hours),
                           __DDL_RTC_CONVERT_BIN2BCD(RTC_AlarmStruct->AlarmTime.Minutes),
                           __DDL_RTC_CONVERT_BIN2BCD(RTC_AlarmStruct->AlarmTime.Seconds));
  }
  /* Set ALARM mask */
  DDL_RTC_ALMA_SetMask(RTCx, RTC_AlarmStruct->AlarmMask);

  /* Enable the write protection for RTC registers */
  DDL_RTC_EnableWriteProtection(RTCx);

  return SUCCESS;
}

/**
  * @brief  Set each @ref DDL_RTC_AlarmTypeDef of ALARMA field to default value (Time = 00h:00mn:00sec /
  *         Day = 1st day of the month/Mask = all fields are masked).
  * @param  RTC_AlarmStruct pointer to a @ref DDL_RTC_AlarmTypeDef structure which will be initialized.
  * @retval None
  */
void DDL_RTC_ALMA_StructInit(DDL_RTC_AlarmTypeDef *RTC_AlarmStruct)
{
  /* Alarm Time Settings : Time = 00h:00mn:00sec */
  RTC_AlarmStruct->AlarmTime.TimeFormat = DDL_RTC_ALMA_TIME_FORMAT_AM;
  RTC_AlarmStruct->AlarmTime.Hours      = 0U;
  RTC_AlarmStruct->AlarmTime.Minutes    = 0U;
  RTC_AlarmStruct->AlarmTime.Seconds    = 0U;

  /* Alarm Day Settings : Day = 1st day of the month */
  RTC_AlarmStruct->AlarmDateWeekDaySel = DDL_RTC_ALMA_DATEWEEKDAYSEL_DATE;
  RTC_AlarmStruct->AlarmDateWeekDay    = 1U;

  /* Alarm Masks Settings : Mask =  all fields are not masked */
  RTC_AlarmStruct->AlarmMask           = DDL_RTC_ALMA_MASK_NONE;
}
#endif /* RTC_ALARMA_SUPPORT */

#if defined (RTC_ALARMB_SUPPORT)
/**
  * @brief  Set the RTC Alarm B.
  * @note   The Alarm register can only be written when the corresponding Alarm
  *         is disabled (@ref DDL_RTC_ALMB_Disable function).
  * @param  RTCx RTC Instance
  * @param  RTC_Format This parameter can be one of the following values:
  *         @arg @ref DDL_RTC_FORMAT_BIN
  *         @arg @ref DDL_RTC_FORMAT_BCD
  * @param  RTC_AlarmStruct pointer to a @ref DDL_RTC_AlarmTypeDef structure that
  *                         contains the alarm configuration parameters.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: ALARMB registers are configured
  *          - ERROR: ALARMB registers are not configured
  */
ErrorStatus DDL_RTC_ALMB_Init(RTC_TypeDef *RTCx, uint32_t RTC_Format, DDL_RTC_AlarmTypeDef *RTC_AlarmStruct)
{
  /* Check the parameters */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));
  ASSERT_PARAM(IS_DDL_RTC_FORMAT(RTC_Format));
  ASSERT_PARAM(IS_DDL_RTC_ALMB_MASK(RTC_AlarmStruct->AlarmMask));
  ASSERT_PARAM(IS_DDL_RTC_ALMB_DATE_WEEKDAY_SEL(RTC_AlarmStruct->AlarmDateWeekDaySel));

  if (RTC_Format == DDL_RTC_FORMAT_BIN)
  {
    if (DDL_RTC_GetHourFormat(RTCx) != DDL_RTC_HOURFORMAT_24HOUR)
    {
      ASSERT_PARAM(IS_DDL_RTC_HOUR12(RTC_AlarmStruct->AlarmTime.Hours));
      ASSERT_PARAM(IS_DDL_RTC_TIME_FORMAT(RTC_AlarmStruct->AlarmTime.TimeFormat));
    }
    else
    {
      RTC_AlarmStruct->AlarmTime.TimeFormat = 0x00U;
      ASSERT_PARAM(IS_DDL_RTC_HOUR24(RTC_AlarmStruct->AlarmTime.Hours));
    }
    ASSERT_PARAM(IS_DDL_RTC_MINUTES(RTC_AlarmStruct->AlarmTime.Minutes));
    ASSERT_PARAM(IS_DDL_RTC_SECONDS(RTC_AlarmStruct->AlarmTime.Seconds));

