betaflight/betaflight/lib/main/APM32F4/Libraries/APM32F4xx_DAL_Driver/Source/apm32f4xx_ddl_rtc.c
  return status;
}

/**
  * @brief  Set each @ref DDL_RTC_AlarmTypeDef of ALARM field to default value (Time = 00h:00mn:00sec /
  *         Day = 1st day of the month/Mask = all fields are masked).
  * @param  RTC_AlarmStruct pointer to a @ref DDL_RTC_AlarmTypeDef structure which will be initialized.
  * @retval None
  */
void DDL_RTC_ALARM_StructInit(DDL_RTC_AlarmTypeDef *RTC_AlarmStruct)
{
  /* Alarm Time Settings : Time = 00h:00mn:00sec */
  RTC_AlarmStruct->AlarmTime.Hours      = 0U;
  RTC_AlarmStruct->AlarmTime.Minutes    = 0U;
  RTC_AlarmStruct->AlarmTime.Seconds    = 0U;
}

#endif /* RTC_ALARM_SUPPORT */

/**
  * @brief  Enters the RTC Initialization mode.
  * @note   The RTC Initialization mode is write protected, use the
  *         @ref DDL_RTC_DisableWriteProtection before calling this function.
  * @param  RTCx RTC Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC is in Init mode
  *          - ERROR: RTC is not in Init mode
  */
ErrorStatus DDL_RTC_EnterInitMode(RTC_TypeDef *RTCx)
{
  __IO uint32_t timeout = RTC_INITMODE_TIMEOUT;
  ErrorStatus status = SUCCESS;
  uint32_t tmp = 0U;

  /* Check the parameter */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));

#if defined (RTC_STS_RINITFLG)
  /* Check if the Initialization mode is set */
  if (DDL_RTC_IsActiveFlag_INIT(RTCx) == 0U)
  {
    /* Set the Initialization mode */
    DDL_RTC_EnableInitMode(RTCx);

    /* Wait till RTC is in INIT state and if Time out is reached exit */
    tmp = DDL_RTC_IsActiveFlag_INIT(RTCx);
    while ((timeout != 0U) && (tmp != 1U))
    {
      if (DDL_SYSTICK_IsActiveCounterFlag() == 1U)
      {
        timeout --;
      }
      tmp = DDL_RTC_IsActiveFlag_INIT(RTCx);
      if (timeout == 0U)
      {
        status = ERROR;
      }
    }
  }
#else
  /* Wait till RTC is in INIT state and if Time out is reached exit */
  tmp = DDL_RTC_IsActiveFlag_RTOF(RTCx);
  while ((timeout != 0U) && (tmp != 1U))
  {
    if (DDL_SYSTICK_IsActiveCounterFlag() == 1U)
    {
      timeout --;
    }
    tmp = DDL_RTC_IsActiveFlag_RTOF(RTCx);
    if (timeout == 0U)
    {
      status = ERROR;
    }
  }

  /* Disable the write protection for RTC registers */
  DDL_RTC_DisableWriteProtection(RTCx);
#endif /* RTC_STS_RINITFLG */
  return status;
}

/**
  * @brief  Exit the RTC Initialization mode.
  * @note   When the initialization sequence is complete, the calendar restarts
  *         counting after 4 RTCCLK cycles.
  * @note   The RTC Initialization mode is write protected, use the
  *         @ref DDL_RTC_DisableWriteProtection before calling this function.
  * @param  RTCx RTC Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC exited from in Init mode
  *          - ERROR: Not applicable
  */
ErrorStatus DDL_RTC_ExitInitMode(RTC_TypeDef *RTCx)
{
  ErrorStatus status = SUCCESS;
  /* Check the parameter */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));

#if defined (RTC_STS_INITEN)
  /* Disable initialization mode */
  DDL_RTC_DisableInitMode(RTCx);
#else
  __IO uint32_t timeout = RTC_INITMODE_TIMEOUT;
  uint32_t tmp = 0U;

  /* Disable initialization mode */
  DDL_RTC_EnableWriteProtection(RTCx);

  /* Wait till RTC is in INIT state and if Time out is reached exit */
  tmp = DDL_RTC_IsActiveFlag_RTOF(RTCx);
  while ((timeout != 0U) && (tmp != 1U))
  {
    if (DDL_SYSTICK_IsActiveCounterFlag() == 1U)
    {
      timeout --;
    }
    tmp = DDL_RTC_IsActiveFlag_RTOF(RTCx);
    if (timeout == 0U)
    {
      status = ERROR;
    }
  }
#endif /* RTC_STS_INITEN */
  return status;
}

/**
  * @brief  Waits until the RTC Time and Day registers (RTC_TIME and RTC_DATE) are
  *         synchronized with RTC APB clock.
  * @note   The RTC Resynchronization mode is write protected, use the
  *         @ref DDL_RTC_DisableWriteProtection before calling this function.
  * @note   To read the calendar through the shadow registers after calendar
  *         initialization, calendar update or after wakeup from low power modes
  *         the software must first clear the RSF flag.
  *         The software must then wait until it is set again before reading
  *         the calendar, which means that the calendar registers have been
  *         correctly copied into the RTC_TIME and RTC_DATE shadow registers.
  * @param  RTCx RTC Instance
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC registers are synchronised
  *          - ERROR: RTC registers are not synchronised
  */
ErrorStatus DDL_RTC_WaitForSynchro(RTC_TypeDef *RTCx)
{
  __IO uint32_t timeout = RTC_SYNCHRO_TIMEOUT;
  ErrorStatus status = SUCCESS;
  uint32_t tmp = 0U;

  /* Check the parameter */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));

  /* Clear RSF flag */
  DDL_RTC_ClearFlag_RS(RTCx);

  /* Wait the registers to be synchronised */
  tmp = DDL_RTC_IsActiveFlag_RS(RTCx);
  while ((timeout != 0U) && (tmp != 1U))
  {
    if (DDL_SYSTICK_IsActiveCounterFlag() == 1U)
    {
      timeout--;
    }
    tmp = DDL_RTC_IsActiveFlag_RS(RTCx);
    if (timeout == 0U)
    {
      status = ERROR;
    }
  }

  return (status);
}

#if defined (RTC_COUNT_SUPPORT)
/**
  * @brief  Set the Time Counter
  * @param  RTCx RTC Instance
  * @param  TimeCounter this value can be from 0 to 0xFFFFFFFF
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC Counter register configured
  *          - ERROR: Not applicable
  */
ErrorStatus DDL_RTC_TIME_SetCounter(RTC_TypeDef *RTCx, uint32_t TimeCounter)
{
  ErrorStatus status = ERROR;
  /* Check the parameter */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));

  /* Enter Initialization mode */
  if (DDL_RTC_EnterInitMode(RTCx) != ERROR)
  {
    DDL_RTC_TIME_Set(RTCx, TimeCounter);
    status = SUCCESS;
  }
  /* Exit Initialization mode */
  DDL_RTC_ExitInitMode(RTCx);

  return status;
}

/**
  * @brief  Set Alarm Counter.
  * @param  RTCx RTC Instance
  * @param  AlarmCounter this value can be from 0 to 0xFFFFFFFF
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: RTC exited from in Init mode
  *          - ERROR: Not applicable
  */
ErrorStatus DDL_RTC_ALARM_SetCounter(RTC_TypeDef *RTCx, uint32_t AlarmCounter)
{
  ErrorStatus status = ERROR;
  /* Check the parameter */
  ASSERT_PARAM(IS_RTC_ALL_INSTANCE(RTCx));

  /* Enter Initialization mode */
  if (DDL_RTC_EnterInitMode(RTCx) != ERROR)
  {
    DDL_RTC_ALARM_Set(RTCx, AlarmCounter);
    status = SUCCESS;
  }
  /* Exit Initialization mode */
  DDL_RTC_ExitInitMode(RTCx);

  return status;
}
#endif /* RTC_COUNT_SUPPORT */
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined(RTC) */

/**
  * @}
  */

#endif /* USE_FULL_DDL_DRIVER */
